---
title: ReferenceWithContext
classe: Autodesk.Revit.DB.ReferenceWithContext
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ReferenceWithContext

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `referenceWithContext.IsValidObject` | Boolean |
| `Double Proximity { get; }` | `referenceWithContext.Proximity` | Double |
| `Void Dispose()` | `referenceWithContext.Dispose()` | Void |
| `Transform GetInstanceTransform()` | `referenceWithContext.GetInstanceTransform()` | Transform |
| `Reference GetReference()` | `referenceWithContext.GetReference()` | Reference |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```